export default function Terms(): JSX.Element {
  return (
    <div className="main-container">
      <h2 className="head">利用規約</h2>

      <div className="Chapter_1">第1章 総則</div>

      <div className="headline_1">
        <h3>第1条 （規約）</h3>
        <p>
          「収支管理 For STEPN利用規約」（以下、「本規約」とします。）は、Aimi
          Takahashi（以下「提供者」）が提供する収支管理 For
          STEPN（以下、「本アプリ」とします。）の利用条件などを定めるものです。本アプリを利用する者（以下、「利用者」とします。）は、本規約に同意し、これを遵守しなければなりません。本規約に同意できない場合、本アプリのダウンロード、インストール及び使用を中止してください。本アプリをダウンロード、インストール又は使用する場合、利用者は、本規約に同意したものとします。
        </p>
      </div>

      <div className="headline_2">
        <h3>第2条 （定義）</h3>
        <p>
          本規約において、次の各号に掲げる用語の意味は、当該各号に定めるとおりとします。
          <br></br>
          1.ユーザー<br></br>
          本規約に同意の上、本サービスを利用する法人、団体、組合または個人をいいます。
          <br></br>
          2.本サイト<br></br>
          当社が本サービスの提供に関連して運営するウェブサイトをいいます。
          <br></br>
          3.本ソフトウェア<br></br>
          当社が本サービスを提供するために作成・公開するアプリケーション・ソフトウェアをいい、アップデート版、修正版、代替品および複製物を含みます。
          <br></br>
          4.登録情報<br></br>
          本サービスの利用に関連して登録することが求められる、当社が定めるユーザーに関する情報をいいます。
          <br></br>
          5.ユーザー情報<br></br>
          本サービスのために当社が使用するサーバーに保存された各種情報や通信記録その他のユーザーの一切の情報をいい、登録情報、本サービスを通じて当社が提供しまたはユーザーが取得した情報を含みます。
          <br></br>
          6.有料サービス<br></br>
          個別サービスのうち、有料にて提供されるサービスをいいます。<br></br>
          7.有料ユーザー<br></br>
          有料サービスの利用を選択したユーザーをいいます。
        </p>
      </div>

      <div className="headline_3">
        <h3>第3条 （規約の変更）</h3>
        <p>
          1.当社は、当社が必要と判断したときは、本規約を変更することができるものとします。
          <br></br>
          2.当社が本規約の内容を変更するときは、当該変更の事実、その効力発生日および変更内容を本規約の定めに従いユーザーに通知または公表します。
        </p>
      </div>

      <div className="headline_4">
        <h3>第4条 （通知・公表）</h3>
        <p>
          1.当社は、本サービスに関連してユーザーに通知または公表をする場合には、本ソフトウェア上に掲示する方法など、当社が適当と判断する方法で実施します。
          <br></br>
          2.本サービスに関する問い合わせその他ユーザーから当社に対する連絡または通知は、当社の定める方法で行うものとします。
        </p>
      </div>

      <div className="Chapter_2">第2章 契約の成立</div>

      <div className="headline_5">
        <h3>第5条 （本規約に関する同意）</h3>
        <p>
          1.ユーザーは、本規約に同意の手続を行った場合のほか、本ソフトウェアの利用を開始した時点で、本規約に有効に同意したものとみなされます。
          <br></br>
          2.未成年者が本サービスの利用を希望する場合には、法定代理人の同意が必要になります。未成年者が本サービスの利用を開始した場合、本サービスの利用および本規約の内容について、法定代理人の同意があったものとみなします。
        </p>
      </div>

      <div className="headline_6">
        <h3>第6条 （有料サービスに関する契約成立、利用料金および支払方法）</h3>
        <p>
          1.有料サービスに係る利用契約は、有料サービスの利用を希望するユーザーが、別途当社が指定する方法で申込みを行い、これを当社が受諾した時点で成立します。
          <br></br>
          2.有料ユーザーは、当社に対して、本サービスの利用の対価として、当社が有料サービスごとに別途定める利用料金を支払います。有料ユーザーは、利用料金を、所定の決済手段および方法により支払うものとし、当社は、いかなる場合にも受領した利用料金の返金には応じません。
          <br></br>
          3.本サービスを利用するために必要となる通信費（本ソフトウェアのダウンロードおよび利用のために発生する通信費を含みます。）、および通信機器等は、ユーザーの負担と責任により準備するものとします。ただし、ユーザーの使用する通信機器等において、本ソフトウェアが正常に動作することを保証するものではありません。
        </p>
      </div>

      <div className="Chapter_3">第3章 サービス利用上の注意事項</div>

      <div className="headline_7">
        <h3>第7条 （ID・パスワード等）</h3>
        <p>
          1.ユーザーは、本サービスに関してID（電子メールアドレス）・パスワード等を設定した場合、これらを自己の責任において厳重に管理するものとし、これらを用いてなされた一切の行為についてその責任を負います。
          <br></br>
          2. ユーザーは、自己以外の者に本サービスを利用させてはいけません。
        </p>
      </div>

      <div className="headline_8">
        <h3>第8条 （登録情報の変更）</h3>
        <p>
          ユーザーは、登録情報に変更が生じた場合には、当社が指定する方法により速やかに届出を行います。当社は、登録情報の変更の届出がなされなかったことによりユーザーに生じた損害について一切の責任を負いません。
        </p>
      </div>

      <div className="headline_9">
        <h3>第9条 （第三者サービス）</h3>
        <p>
          1.当社以外の第三者がウェブサイトまたはアプリケーション・ソフトウェアを介して運営するサービス（以下「第三者サービス」といいます。）と本サービスの連携機能（本サービスにおけるデータ等の出入力機能を含みます。）は、当社と第三者サービスの運営者との間の提携、協調、授権その他の一切の協力関係を意味するものではなく、ユーザーは、第三者サービスとの連携機能により出力・入力されるデータ等の正確性、完全性等につき、適宜、第三者サービスにおいても確認を行うものとします。
          <br></br>
          2.ユーザーは、自己の責任において、第三者サービスを利用するものとし、第三者サービスとの連携機能に起因する当該サービスの運営者またはその他第三者との間での紛争その他一切の債権債務関係について、自己の責任と費用で解決するものとし、当社に何ら迷惑をかけず、またこれにより当社が被った損害（弁護士費用を含みます。）を補償します。
          <br></br>
          3.ユーザーは、第三者サービスとの連携により出力・入力されるデータが、通信設備等の異変により本ソフトウェアまたは第三者サービスにおいて正確に表示されない可能性があることを予め了承します。
          <br></br>
          4.第三者サービスの利用は、ユーザーと第三者サービスの運営者との間での別途の契約に従うものとします。
        </p>
      </div>

      <div className="headline_10">
        <h3>第10条 （バックアップ）</h3>
        <p>
          1.ユーザーは、ユーザー情報の全てについて、自己の責任において記録し、保存・管理します。
          <br></br>
          2.ユーザーは、ユーザー情報について、自己の責任においてバックアップ作業を行うものとし、当社は、バックアップデータが存在しないこと、またはユーザーがバックアップ作業を適切に実施しなかったこと等により発生したユーザーの損害および不利益につき、一切の責任を負いません。
          <br></br>
          3.当社は、ユーザー情報をバックアップとして記録することがあります。ただし、前項に定めるユーザーの責任において行うバックアップを補完するものではなく、ユーザー情報の復旧を保証するものではありません。
          <br></br>
          4.ユーザーは、ユーザー情報の一部が一定期間をもって自動的に消去される場合があることを予め了承します。
        </p>
      </div>

      <div className="headline_11">
        <h3>第11条 （禁止行為）</h3>
        <p>
          ユーザーは、本サービスに関連して次の各号に定める行為を行ってはいけません。
          <br></br>
          1.当社に対して虚偽の申告をする行為<br></br>
          2.本サイトおよび本ソフトウェアを含む情報および役務を本サービスの利用以外の目的のために使用する行為
          <br></br>
          3.当社もしくは第三者の財産（知的財産権を含みます。）、プライバシー、名誉、信用、肖像、パブリシティその他の権利・利益を侵害する行為または侵害するおそれのある行為
          <br></br>
          4.前号以外で当社もしくは第三者の権利・利益を侵害する行為または侵害するおそれのある行為
          <br></br>
          5.法令に違反し、もしくは公序良俗に反する行為またはそのおそれのある行為
          <br></br>
          6.第三者のユーザーのID・パスワード等を不正に使用または取得する行為その他ユーザーが、第三者を装って本サービスを利用する行為
          <br></br>
          7.コンピュータウィルスなどの有害なプログラムを使用し、もしくは送信する行為、またはそのおそれのある行為
          <br></br>
          8.前号に定めるものの他、不正アクセス行為等当社による業務の遂行、本サービスの実施もしくは当社の通信設備等に支障を及ぼし、またはそのおそれがあると当社が判断する行為{" "}
        </p>
      </div>

      <div className="Chapter_4">第4章 解約・解除・退会</div>

      <div className="headline_12">
        <h3>第12条 （有料サービスの解約）</h3>
        <p>
          1.有料ユーザーは、有料サービスに係る利用契約を解約する場合、当社所定の方法により解約手続きを行うこととし、当該解約手続きの完了をもって、有料サービスに係る利用契約が解約されるものとします。
          <br></br>
          2.前項に基づきユーザーが有料サービスに係る利用契約を解約した場合でも、当社は、既に受領した利用料金の返金は行いません。
          <br></br>
          3.ユーザーが第１項により有料サービスに係る利用契約を解約した場合、当社はユーザー情報を消去することができます。
        </p>
      </div>

      <div className="headline_13">
        <h3>第13条 （当社による契約解除・利用停止）</h3>
        <p>
          1.当社は、ユーザーが次の各号の一つに該当した場合には、ユーザーに対して何らの通知催告をすることなく、有料サービスに係る利用契約の一部または全部を解除し、または本サービスの一部または全部の利用を停止することができます（以下「利用停止処分等」といいます。）。
          <br></br>
          (1)本規約に違反する行為を行った場合<br></br>
          (2)当社に提供された登録情報の全部または一部につき虚偽、誤記または記載漏れがあった場合
          <br></br>
          (3)現に制限行為能力者であるか、または制限行為能力者になった場合において、催告後相当期間を経過しても法定代理人の記名押印のある同意書または追認書の提出がない場合
          <br></br>
          (4)反社会的勢力等（暴力団、暴力団員、右翼団体、反社会的勢力、暴力団準構成員、総会屋、社会運動等標榜ゴロ、特殊知能暴力集団その他これに準ずる者を意味します。以下同じ。）である、資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの交流もしくは関与を行っている、または反社会的勢力等が経営に実質的に関与している法人等であると当社が合理的に判断した場合
          <br></br>
          (5)利用料金の支払方法として指定された手段の利用が停止された場合
          <br></br>
          (6)仮差押え、差押え、競売、破産手続開始、会社更生手続開始、民事再生手続開始等の申立があった場合、または公租公課等の滞納処分を受けた場合
          <br></br>
          (7)過去に本サービスについて利用停止処分等を受けたことが判明した場合
          <br></br>
          (8)その他、当社がユーザーとして不適当であると合理的に判断した場合
          <br></br>
          2.前項に基づきユーザーが利用停止処分等を受けた場合でも、当社は、既に受領した利用料金の返金は行わず、また、ユーザーおよび第三者に生じた損害および不利益につき一切の責任を負いません。
          <br></br>
          3.第１項に基づきユーザーが利用停止処分等を受けた場合、当社はユーザー情報を消去することができます。
        </p>
      </div>

      <div className="Chapter_5">第5章 サービスの停止、変更および終了</div>

      <div className="headline_14">
        <h3>第14条 （サービスの停止）</h3>
        <p>
          1.当社は、次の各号のいずれかの事由が生じた場合には、事前にユーザーに通知をすることなく、本サービスの一部または全部を停止することができます。
          <br></br>
          (1)本サービス提供にあたり必要なシステム、設備等に障害が発生し、またはメンテナンス、保守もしくは工事等が必要となった場合
          <br></br>
          (2)電気通信事業者が電気通信サービスの提供を中止するなど、当社以外の第三者の行為に起因して、本サービスの提供を行うことが困難になった場合
          <br></br>
          (3)非常事態（天災、戦争、テロ、暴動、騒乱、官の処分、労働争議等）の発生により、本サービスの提供が困難になった場合、または困難になる可能性のある場合
          <br></br>
          (4)法令規制、行政命令等により、本サービスの提供が困難になった場合
          <br></br>
          (5)その他、当社の責めに帰することができない事由により、当社が必要やむを得ないと判断した場合
          <br></br>
          2.当社は、前項に基づいて本サービスを停止したことによりユーザーおよび第三者に生じた損害および不利益につき一切の責任を負いません。
        </p>
      </div>

      <div className="headline_15">
        <h3>第15条 （サービスの変更）</h3>
        <p>
          1.当社は、当社の裁量により本サービスの一部の内容を追加または変更することができます。当社は、本条に基づく本サービスの追加または変更により、変更前の本サービスのすべての機能・性能が維持されることを保証するものではありません。
          <br></br>
          2.当社は、前項に基づいて本サービスを追加または変更したことによりユーザーに生じた損害および不利益につき一切の責任を負いません。
        </p>
      </div>

      <div className="headline_16">
        <h3>第16条 サービスの中止および終了</h3>
        <p>
          1.当社は、事前にユーザーに通知をしたうえで、当社の裁量により本サービスの一部もしくは全部の提供を中止または終了することができます。ただし、中止または終了の内容が重大でない場合には、通知をすることなくこれらを実施することができます。
          <br></br>
          2.当社は、前項に基づいて本サービスを中止または終了したことによりユーザーに損害が発生した場合でも、一切の責任を負いません。
        </p>
      </div>

      <div className="Chapter_6">第6章 本ソフトウェアの提供</div>

      <div className="headline_17">
        <h3>第17条 （使用許諾）</h3>
        <p>
          当社は、本サービスの利用に際して本ソフトウェアをダウンロードしたユーザーに対し、本規約に従うことを条件に、本ソフトウェアの非独占的な使用を許諾します。
        </p>
      </div>

      <div className="headline_18">
        <h3>第18条 （ソフトウェアに関する禁止事項）</h3>
        <p>
          ユーザーは、本ソフトウェアの利用にあたり、第１１条に定める事項の他、次の各号に定める行為を行ってはいけません。
          <br></br>
          (1)本ソフトウェアの複製、翻訳、翻案等の改変を行うこと<br></br>
          (2)本ソフトウェアの販売、配布、再使用許諾、公衆送信（送信可能化を含みます。）、貸与、譲渡、またはリースその他の処分を行うこと
          <br></br>
          (3)本ソフトウェアに設けられたコピーガード等の技術的な保護手段を回避する方法で使用すること
          <br></br>
          (4)第三者が複製できるように本ソフトウェアを公開すること<br></br>
          (5)前各号に定める他、本ソフトウェアの利用目的に照らして当社が不適切と判断する行為
        </p>
      </div>

      <div className="headline_19">
        <h3>第19条 （利用制限）</h3>
        <p>
          1.利用資格等の確認ができない場合、ユーザーによる本ソフトウェアの利用の一部または全部が制限されることがあります。
          <br></br>
          2.当社は、本ソフトウェアに関するサポート、修正版（アップデート版を含みます。）の提供を行う義務を負いません。またあらかじめユーザーへ通知を行うことなく、本ソフトウェアの修正、変更、アップデートまたは提供の終了を行う場合があります。
        </p>
      </div>

      <div className="Chapter_7">第7章 一般条項</div>

      <div className="headline_20">
        <h3>第20条 （保証）</h3>
        <p>
          1.当社は、本サービスが推奨環境において機能するように合理的な最大限の努力を行います。ただし、当社は、ユーザー情報が正確性、正当性、有用性、完全性等を有することを保証するものではありません。ユーザーは、ユーザー情報について、自らの判断および責任において必要に応じ変更、修正等を行ったうえで利用するものとします。
          <br></br>
          2.当社は、本サービスにより税理士法に定める税理士業務および公認会計士法所定の公認会計士業務をユーザーに提供するものではありません。
        </p>
      </div>

      <div className="headline_21">
        <h3>第21条 （知的財産権）</h3>
        <p>
          本サービスに関する著作権、著作者人格権、特許権、実用新案権、意匠権、商標権およびパブリシティ権等の一切の知的財産権は当社および正当な権利者たる第三者に帰属します。
        </p>
      </div>

      <div className="headline_22">
        <h3>第22条 （損害賠償および免責）</h3>
        <p>
          1.当社は、本サービスに関してユーザーに生じた損害について、当社に故意または重過失が認められる場合には、当該損害の直接の原因となったサービスについて、当該ユーザーから受領した利用料金の１か月分に相当する額を上限としてその損害を賠償するものとし、それ以外の損害については一切の責任を負いません。
          <br></br>
          2.ユーザーは、本規約に違反することにより、または本サービスの利用に関して当社に損害を与えた場合、当社に対し当社に生じた損害を賠償しなければなりません。
          3.本サービスに関してユーザーと第三者との間に紛争が生じた場合、ユーザーは自己の責任と費用で解決するものとし、当社に何ら迷惑をかけず、またこれにより当社が被った損害（弁護士費用を含みます。）を補償します。
        </p>
      </div>

      <div className="headline_23">
        <h3>第23条 （委託）</h3>
        <p>
          当社は、本サービスに関する業務の一部または全部を第三者に委託することができるものとします。
        </p>
      </div>

      <div className="headline_24">
        <h3>第24条 （情報管理）</h3>
        <p>
          収支管理 For
          STEPNでの記録はiOSデバイスのみに保存されます。ユーザーが入力した記録をサーバーに送信することはありません。
        </p>
      </div>

      <div className="headline_25">
        <h3>第25条 （個人情報）</h3>
        <p>
          当社の個人情報の取扱いについてはプライバシーポリシーに定めるとおりとします。
        </p>
      </div>

      <div className="headline_26">
        <h3>第26条 （権利義務の譲渡禁止）</h3>
        <p>
          ユーザーは、当社の事前の書面による承諾を得ることなく、本サービスに関する権利義務を第三者に譲渡（合併、会社分割等による包括承継も含みます。）しまたは担保の目的に供してはならないものとします。
        </p>
      </div>

      <div className="headline_27">
        <h3>第27条 （準拠法、管轄裁判所）</h3>
        <p>
          1.本規約は、日本法によって解釈され、日本法を準拠法とします。<br></br>
          2.本規約または本サービスに関してユーザーと当社の間に紛争が生じた場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </p>
      </div>

      <div className="headline_28">
        <h3>第28条 （本規約の適用制限）</h3>
        <p>
          本規約の一部の条項が法令に違反するとされた場合、当該条項は、その限りにおいて本サービスについて適用されないものとし、本規約の他の条項は引き続き有効に存続するものとします。
        </p>
      </div>
    </div>
  );
}
